Revit 2027 API
SpatialElementGeometryCalculator.GetOptions Method
 The options that control the calculation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpatialElementBoundaryOptions GetOptions()
Public Function GetOptions As SpatialElementBoundaryOptions
public:
SpatialElementBoundaryOptions^ GetOptions()
member GetOptions : unit -> SpatialElementBoundaryOptions
Return Value
SpatialElementBoundaryOptions
 The options.
See Also
Reference
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace